import React from "react";
import styles from './PublickOffer.module.css'

const PublickOffer = () => {
  return (
    <div className={styles.box}>
      <p className={styles.text}>
        Будь ласка, уважно прочитайте Договір публічної оферти, правила і умови
        використання сайту та правила конфіденційності, перед тим, як користуватися
        послугами сайту busfor.ua. Якщо Ви не згодні з Договором публічної оферти,
        правилами та умовами, будь ласка, не використовуйте сайт busfor.ua. Зауважте, що
        Договір публічної оферти, правила і умови можуть змінюватися без попередження.
        Зміни в Договорі публічної оферти, правилах і умовах набирають чинності з моменту
        їх публікації на сайті busfor.ua. Здійснення вами оплати є свідченням вашого
        безумовного акцепту договору публічної оферти та погодження з правилами й умовами,
        визначеними власником сайту busfor.ua. Текст від 24 травня 2018 року. ДОГОВІР
        ПУБЛІЧНОЇ ОФЕРТИ Товариство з обмеженою відповідальністю «І-Тревелс» (далі
        Busfor), ЄДРПОУ 35389109, адреса: 03056, Україна, Київ, вулиця Польова 21,
        керуючись ст. 633. Цивільного кодексу України, пропонує необмеженому колу осіб
        (далі Користувач) укласти Договір публічної оферти (далі Договір), з метою пошуку
        та/або придбання квитків за допомогою сайту busfor.ua, та/або додаткових сервісів
        Busfor. Користувач може діяти в межах Договору від свого імені та на свою користь
        та/або від імені третьої сторони та на її користь, у такому випадку Користувач діє
        виключно в межах повноважень наданих третьою стороною. Busfor є інтегрованим
        дистриб'ютором послуг перевезення, що поставляються перевізниками, автостанціями,
        консолідаторами ресурсів перевізника та третіми особами, далі званими
        «Постачальник». Квиток (у тому числі і електронний квиток) - проїзний документ
        встановленої форми, який дає право пасажиру на одержання транспортних послуг
        автобусного перевезення, створений в автоматизованій системі Busfor, надсилається
        на електронну адресу вказану при замовленні або іншим чином видається Користувачу.
        Номер квитка є номером договору публічної оферти і номером договору пасажирського
        перевезення. Користувач і Busfor обізнані із загальними вимогами укладання
        Договорів, додержання яких є необхідним для чинності правочину, володіючи повним
        обсягом цивільної дієздатності та цивільної правоздатності, мають відповідні
        повноваження на укладання такого правочину, повністю усвідомлюючи значення своїх
        дій та згідно з вільним волевиявленням, яке відповідає внутрішній волі учасників
        цього правочину, маючи на меті реальне настання правових наслідків, розуміючи
        правову природу цього правочину, а також свої права та обов’язки за Договором, у
        відповідності до чинного законодавства уклали цей Договір про нижчевикладене:
        ПРЕДМЕТ ДОГОВОРУ. За Договором, Busfor надає послуги з пошуку відповідного
        Постачальника, у відповідності до дати, часу та напрямку обраного Користувачем,
        формування стиковок різних Постачальників, укладення договору перевезення (шляхом
        продажу/придбання Квитка), оформлення квитків різних Постачальників одним
        замовленням, попереднього продажу квитків, бронювання місць, замовлення квитка по
        телефону, переоформлення квитка, пошук оптимального розкладу за запитом
        Користувача, сервісне обслуговування користувача, у тому числі і цілодобову
        підтримку Користувача Центром сервісного обслуговування, додаткові послуги за
        запитами Користувача, а також попередньої оплати Квитка коштами отриманими від
        Користувача (далі Послуги). За Послуги, що надаються, Busfor отримує винагороду,
        що складається із суми коштів, що входять до вартості Квитка та визначені, як
        Агентська винагорода (оплачується Постачальником) та Сервісний збір (оплачується
        Користувачем). Busfor, діючи як агент, від імені, за рахунок в інтересах
        Постачальника, за допомогою сайту, продає автобусне пасажирське перевезення (далі
        Квиток), спеціальні пропозиції, знижки та надає інформацію Постачальника. Кожне
        придбання Квитка окремо взятого Постачальника, підпорядковується правилам та
        умовам саме цього Постачальника і є невід’ємною частиною Договору. У випадку
        придбання декількох Квитків одним замовленням, правила і умови одного чи іншого
        Постачальника можуть відрізнятись. Недотримання правил і умов Постачальника та/або
        Busfor може призвести до скасування замовлень і відмову у доступі до Сайту та/або
        придбаних послуг, у тому і числі і можливістю скористатись Квитком, без повернення
        витрачених на його придання коштів. Придбання Квитка Користувачем на пільгових
        умовах (безкоштовне перевезення і т.п.) відповідно до законодавства України,
        здійснюється виключно в касі/офісі відповідного Постачальника, або за дозволом
        відповідного Постачальника. ПРАВА І ОБОВ’ЯЗКИ СТОРІН. Користувач має право:
        Отримати послуги за Договором; Скористатись Квитком, у відповідності до обраної
        дати, часу, місця відправлення та обраного Постачальника; Повернути Квиток, на
        умовах визначених Постачальником та/або Busfor; Вимагати компенсації завданих
        збитків, що виникає з умов Договору, шляхом направлення відповідного звернення на
        адресу Busfor. У випадку завдання моральної шкоди Користувачу, діями або
        бездіяльністю Busfor, сума відшкодування, при її доведенні та обґрунтуванні не
        може перевищувати суму більшу чим вартість Квитка. ЗАУВАЖТЕ, що деякі
        Постачальники, зобов’язують здійснити обмін та/або повернення квитка виключно у
        касі автостанції без можливості повернення коштів, через сайт або в офісі партнера
        Busfor, де проводилась оплата. Умови такого обміну та/або повернення наведені у
        Квитку. Користувач зобов’язаний: Здійснити попередню оплату Квитка, у 100 %
        вартості вказаній на сайті; Перевірити дату, час, місто/місце відправлення,
        місто/місце прибуття одразу після придбання Квитка; Завчасно прибути до місця
        відправлення; Повідомити Busfor про неможливість використання Квитка з тієї чи
        іншої причини; Ознайомитись з умовами повернення Квитка; Зв’язатись з Busfor до
        моменту оплати Квитка, у випадку відсутності, умов повернення придбаного Квитка
        обраного Постачальника на Сайті. Купуючи Квиток на двох або більше Постачальників
        або до пункту здійснення пересадки, за допомогою Сайту, Користувач зобов’язаний
        самостійно визначити достатню кількість часу для здійснення пересадки, у тому
        числі якщо така посадка запропонована на Сайті. Рекомендована кількість годин
        очікування в пункті пересадки становить, для внутрішньо державних рейсів 4 години,
        для міждержавних 8 годин від моменту прибуття за розкладом. ЗАУВАЖТЕ, що
        Користувач зобов’язаний ознайомитись з правилами і умовами обраного Постачальника
        до придбання квитка обраного Постачальника, тим самим надає згоду виконувати і
        діяти відповідно до правил та умов Постачальника. Деякі Постачальники надають
        можливість визначити умови повернення певного квитка тільки після його придбання.
        Виходячи з такої специфіки Користувач погоджується, з тим що утримання при
        поверненні такого квитка, може дорівнювати 100% вартості квитка, навіть при умові
        оформлення повернення квитка через 15 хвилин після його оплати. Busfor має право:
        Діяти від імені Постачальника, в межах повноважень визначених договірними
        відносинами; Укласти договір перевезення між Користувачем та Постачальником, на
        умовах та в спосіб визначений Постачальником; Встановити та отримати додаткову
        винагороду з Користувача, за додатково надані сервіси та/або послуги. Busfor має
        право записувати телефонні розмови з Користувачем та/або Пасажиром, у випадку
        звернення до сервісного центру та/або у випадку обслуговування
        Користувача/Пасажира та/або необхідності повідомити Користувача/Пасажира та/або
        отримати додаткові відомості у відношенню будь якого Квитка, здійсненого за
        допомогою сервісу Busfor та/або Сайту. Busfor зобов’язаний: Вчасно повідомити
        Постачальника про придбаний Квиток, і додаткові послуги оплачені Користувачем;
        Надіслати Користувачу Квиток відповідно до форми встановленої і прийнятої
        Постачальником; Переказати кошти отримані від Користувача, в якості оплати Квитка,
        на розрахунковий рахунок Постачальника; Повідомити Користувача, про зміни в умовах
        надання послуг (за умови повідомлення про такі зміни Постачальником); Повідомити
        Користувача, про зміну або скасування рейсу (у випадку надходження такої
        інформації від Постачальника); Прийняти звернення від Користувача, розглянути його
        самостійно або направити для розгляду відповідному Постачальнику; Своєчасно
        повідомити Користувача про розгляд звернення, а у випадку надсилання звернення
        Постачальнику про результати його розгляду (у випадку надходження такої відповіді
        на адресу Busfor). ЗАУВАЖТЕ, Busfor, надає відповідь на звернення, способом
        аналогічним до його надходження. Надсилання відповіді третій стороні (у тому числі
        і за проханням Користувача) здійснюватися не буде. ВЗАЄМОРОЗРАХУНКИ. Кошти
        отримані від Користувача, в рахунок придбання Квитка належать Постачальнику (за
        виключенням Сервісного збору Busfor (у випадку, якщо такий входив до вартості
        Квитка). Busfor проводить розрахунок за придбаний Користувачем Квиток на у мовах і
        в строки визначені Постачальником. Користувач одноосібно відповідальний за всі
        комісійні витрати та інші визначені банком витрати, які можуть бути додані до ціни
        Квитка або додаткових послуг, емітентом кредитної або дебетної картки, крім
        випадків, в яких витрати приписані до відповідальності Busfor. Банківські послуги,
        пов’язані з переказом коштів в межах Договору, оплачуються Стороною, яка їх
        здійснює. ІДЕНТИФІКАЦІЯ КОРИСТУВАЧА. У якості ідентифікатора Користувача
        використовується e-mail адреса та/або номер телефону, що вказується при придбанні
        Квитка. Зверненням з номера телефона/e-mail адреси залишеної при придбанні Квитка,
        дозволяє Busfor ідентифікувати Користувача, як належну Сторону Договору з
        відповідними правами та обов’язками, і дозволяє здійснювати дії по відношенню, як
        до Договору загалом, так і до конкретно придбаного Квитка. Звернення Користувача з
        іншого номера телефона та/або e-mail адреси наданого при придбанні Квитка, дає
        право Busfor вимагати від Користувача додатково ідентифікувати себе, як належну
        сторону Договору. У випадку неможливості ідентифікувати Користувача, як сторону
        Договору Busfor залишає за собою право відмовити у розгляді звернення.
        Відповідальність за збереження та/або доступ до номера телефона та/або e-mail
        адреси покладається на Користувача. УМОВИ ПОВЕРНЕННЯ КВИТКА. Примусове повернення
        коштів за Квиток: У випадку повідомлення Постачальником про скасування рейсу, з
        тієї чи іншої причини, Busfor здійснює повернення Коштів отриманих в якості оплати
        Квитка, шляхом яким вони надійшли у 100% розмірі до вартості Квитка, або за
        наявності, пропонує придбати інший Квиток на рейс того самого або іншого
        Постачальника. ЗАУВАЖТЕ, вартість Квитка на рейс іншого постачальника може
        відрізнятись. Добровільне повернення: У разі оформлення повернення Квитка, за
        власної ініціативи Користувача, Busfor повертає кошти користувачу керуючись даними
        автоматизованих розрахунків повернення грошових коштів наданих Постачальником;
        Умови повернення Квитка кожного Постачальника відрізняється у відповідності до
        внутрішніх правил; Агентська винагорода та Сервісний збір Busfor, у випадку
        добровільного повернення Квитка, поверненню не підлягає; Квиток придбаний
        Користувачем за акційними та/або зниженими тарифами, у тому числі і при
        використанні коду, що надає право на знижку, повертаються на умовах 100 %
        утримання від вартості Квитка. Кошти або частина Коштів, при умові вирахування
        обов’язкових утримань, при поверненні Квитка безпосередньо через Сайт,
        перераховуються на Користувачу протягом 10 днів після відправлення останнього
        рейсу з замовлення та/або прийнятого Постачальником та/або Busfor рішення, щодо
        повернення Користувачу коштів, шляхом аналогічним надходженню коштів. У випадку
        незгоди Користувача, з сумою що повернута або підлягає поверненню, рішення щодо
        суми такого повернення, приймає виключно Постачальник. ЗАУВАЖТЕ, що Постанова
        Кабінету Міністрів України № 176 від 18 лютого 1997 р. «Про затвердження правил
        надання послуг пасажирського автомобільного транспорту», регулює питання
        повернення Квитка виключно у касу Автостанції, а також не охоплює поняття
        Постачальник, у відповідності до умов Договору. Процедура повернення квитка:
        Користувач, подає запит на повернення виключно через особистий кабінет на Сайті,
        детально описуючи ситуацію або надаючи супровідну інформацію (докази) при подачі
        запиту на повернення через особистий кабінет. Шляхи оформлення/подання запиту на
        повернення Квитка Користувачем: - варіант А. Користувач авторизується на Сайті за
        допомогою номеру телефону, який вказував при замовленні; - варіант Б. Користувач
        Переходить за посиланням на повернення яке надається разом з Квитком, отриманим на
        email (вказаний при замовленні) відразу після оплати замовлення; ЗАУВАЖТЕ, у
        випадку коли користувач немає можливості скористатися одним з варіантів звернення
        передбачених п.5, тим самим надати Busfor можливість ідентифікувати себе, як
        належного користувача, Busfor залишає за собою право відмовити в розгляді такого
        звернення в цілях безпеки наших Користувачів/Пасажирів. У випадку якщо звернення
        Користувача полягає не тільки в поверненні коштів за замовлення, то це
        розцінюється, як претензія і подається клієнтом в офіційній формі згідно закону
        України "Про звернення громадян". КОМПЕНСАЦІЇ. У виключних ситуаціях Busfor, має
        право повернути повну вартість або частину вартості Квитка Користувачу, без
        погодження суми повернення з Постачальником. Таке повернення здійснюється за
        рахунок власних коштів Busfor. Busfor, не компенсує вартість або частину вартості
        Квитка придбаного Користувачем, з метою дістатись до пункту пересадки або
        кінцевого пункту, придбаному, як на Сайті на іншому веб-сайті. УМОВИ НАДАННЯ
        ІНФОРМАЦІЇ. Для здійснення оформлення та придбання Квитка на Сайті необхідно
        надати певну інформацію, а саме: Ім’я і Прізвище пасажира (номер документу за яким
        його можна ідентифікувати (встановлюється опційно Постачальником)), діючу е-mail
        адресу та номер телефону. Також при покупці необхідно вказати платіжну інформацію,
        пов'язану з банківськими картками - тобто їх номери і терміни дії. Вводити дану
        інформацію необхідно при кожній покупці на захищеному сервісі обраної платіжної
        системи. ГАРАНТІЇ СТОРІН. Здійснюючи покупку через Сайт Користувач підтверджує,
        свою дієздатність та дає згоду на обробку своїх персональних даних. Користувач
        погоджуєтеся сплатити ціну Квитка і відповідні податки для всіх зроблених покупок,
        оплачених кредитними або дебітними картками або іншим дозволеним методом оплати.
        Користувач погоджується сплатити всі визначені Busfor кошти у разі якщо платіж не
        здійснено, повернуто або відхиллено банком Корисувача. Busfor, здійснюючи продаж
        Квитка за допомогою Сайту, підтверджує наявне у нього право на продаж даного
        Квитка, у відповідності до умов і обов’язків, визначених Постачальником. Busfor
        зберігає за собою право на свій розсуд блокувати кредитні та дебетні картки за
        підозрілу активність. КОНФІДЕНЦІЙНА ІНФОРМАЦІЯ. Користувач підтверджує згоду з
        тим, що несе особисту відповідальність за надану для збереження конфіденційної
        інформації. Busfor не несе відповідальності за будь-які збитки, завдані внаслідок
        несанкціонованого використання конфіденційної інформації залишеної Користувачем.
        Вся особиста інформація, отримана Busfor в результаті здійснення замовлень через
        Сайт зберігається згідно з правилами та положеннями про конфіденційність, які є
        невід'ємною частиною Договору. Busfor залишає за собою право використовувати та
        розкривати інформацію про Користувача або про замовлення здійсненні Користувачем,
        на умовах дотримання Конфіденційності. З метою захисту ділових інтересів, Busfor
        надає відповідь на письмовий запит «Про надання інформації про Постачальника», що
        надійшов на нашу адресу з обов’язковим попередженням та отриманням дозволу Сторони
        по відношенні до якої здійснюється запит, у тому числі і за запитами відповідних
        державних чи інших органів уповноважених законом на отримання такої інформації.
        Busfor зберігає за собою право змінювати правила Конфіденційності в будь-який час,
        виключно в сторону покращення, з подальшим розширенням умов збереження
        конфіденційної інформації. ЗГОДА НА ОБРОБКУ ПЕРСОНАЛЬНИХ ДАНИХ. Користувач надає
        згоду та підтверджує, що дані вказані ним при приданні Квитка правдиві, і
        Користувач має право вказати їх при купівлі Квитка та залишити для подальшої
        обробки та збереження, у тому числі, але не обмежуючись, для: передачі їх третій
        стороні, яка тим чи іншим чином пов’язана з цим Договором, або з метою його
        повного виконання; додаткового інформування Користувача, про статус виконання
        рейсу, зміни в його умовах; подальшої обробки замовлень Користувача; отриманні
        сервісних повідомлень, у тому числі щодо акцій, бонусних програм і знижок, що
        проводяться Busfor. АВТОРСЬКІ ТА МАЙНОВІ ПРАВА, ТОВАРНІ ЗНАКИ. Всі матеріали на
        Сайті включаючи, але не обмежуючись назвами, логотипами, торговими знаками,
        знаками обслуговування, торговими іменами, фотографіями, текстами, колонками,
        малюнками, кліпами і іншими елементами змісту сайту (далі згадується, як «Зміст»)
        захищені авторськими правами та правами інтелектуальної власності. Зміст
        контролюється і належить Busfor, а також третім особам, які дали дозвіл на
        розміщення Змісту або забезпечили Busfor матеріалами у інший спосіб. Зміст
        охороняється законами, включаючи міжнародні угоди та інші закони щодо захисту
        інтелектуальних прав. Сайт зареєстрований, як спільна робота, згідно з чинними
        законами з авторського права, координація, розташування і оновлення Змісту
        захищені авторським правом. Користувачу слід виходити з того, що весь Зміст Сайту
        захищено авторським правом, якщо інше не обумовлено, і користувач на може
        використовувати Сайт у спосіб, відмінний від зазначеного в Договорі та Правилах,
        або без отримання на те згоди Busfor. Busfor не дає гарантій і запевнень в тому,
        що використання Користувачем матеріалів, представлених на Сайті не складе
        порушення прав третіх сторін. Всі товари, послуги, програми та технології, опис
        яких наведено на Сайті можуть бути об'єктом інших прав власності (включаючи, але
        не обмежуючись, авторські права, права на торговельні знаки і патентні права), що
        належать Busfor. Busfor залишає за собою право докладно не обумовлювати їх в
        даному Договорі. Користувач визнає і погоджуєтеся, що не одержує жодних прав
        інтелектуальної власності, коли користуєтеся, завантажує або роздруковує захищений
        авторськими правами матеріал. Будь-яка спроба несанкціонованого порушення права
        Busfor у зв'язку із Змістом сайту, як і будь-яка спроба нашкодити системі безпеки
        сайту, або використовувати Зміст сайту в цілях, не передбачених правовласником є
        порушенням законодавства про авторські права, товарні знаки, нормативних актів про
        конфіденційну і відкриту інформацію, а також інших правових норм і положень.
        Будь-які продукти, послуги, програми та технології, які описуються в будь-якому
        документі, розміщеному цьому сайті, можуть служити предметом інших прав
        інтелектуальної власності, що належать Busfor. Жоден елемент змісту Сайту не
        повинен розумітися, як надання ліцензії або права, в порядку презумпції,
        позбавлення права, заперечення або інше, у тому числі, але не обмежуючись, права
        на використання яких-небудь товарних знаків, показаних на Сайті, без виданого в
        письмовій формі дозволу Busfor або третьої сторони, яка є власником зазначених
        товарних знаків. Неналежне використання будь-яких товарних знаків або будь-якого
        іншого матеріалу, розміщеного на Сайті не допускається. ВІДПОВІДАЛЬНІСТЬ СТОРІН. У
        разі невиконання або неналежного виконання однією із Сторін зобов’язань за
        Договором, винна Сторона зобов’язана відшкодувати протилежній Стороні заподіяні і
        доведені такими діями збитки. Користувач особисто несе відповідальність за
        дотримання умов і правил обраного Постачальника та Договору і правил використання
        Сайту. Користувач несе одноосібну відповідальність, у зв'язку з не здатністю
        надати достовірну інформацію, у тому числі і про особу від імені якої він діє в
        межах даного Договору, включно, але не обмежуючись, за неможливість використання
        персональної інформації на Сайті, без будь-яких виключень, у тому числі, але не
        обмежуючись і у випадку відсутності у Користувача достовірної персональної
        інформації. Користувач згоден відшкодовувати збитки завдані Busfor, а випадку
        необхідності, захищати інтереси Busfor (у тому числі, але не обмежуючись
        засновників, дочірні підприємства, пов'язані компанії, кожного з працівників,
        директорів, співробітників, агентів, підрядників і представників від будь-яких
        претензій, збитків, витрат і зобов'язань (включаючи відповідні витрати на юридичну
        допомогу)), пов’язаних із виконанням умов цього Договору. ЗАУВАЖТЕ, даний Договір
        регулює виключно умови придбання обраного Користувачем Квитка, який в свою чергу є
        свідченням укладення договору Перевезення. ЗВІЛЬНЕННЯ ВІД ВІДПОВІДАЛЬНОСТІ СТОРІН.
        Сторона звільняється від відповідальності за порушення умов Договору, якщо вона
        доведе, що це порушення сталося внаслідок дії або бездіяльності третьої сторони.
        Користувач розуміє і погоджуєтесь з тим, що Busfor не несе жодної відповідальності
        за будь-які прямі, непрямі, побічні та штрафні збитки; а також за незручності
        пов’язанні з виконанням перевезення (у тому числі, але не обмежуючись, затримки
        рейсів, скасування рейсів, пропущені стикування рейсів) або інші можливі проблеми,
        що мали місце у зв'язку з Вашим відвідуванням або використанням Сайту. Busfor не
        несе відповідальність за помилки або неточності в умовах і цінах з продажу
        автобусних Квитків та інших товарів і послуг, якщо такі надані Постачальником.
        Busfor не несе відповідальності за втрати і збитки, понесені Користувачем в
        процесі поїздок в різні точки світу. Користувач погоджується з тим, що отримуєте
        доступ до товарів і послуг, і інформації про автобусні перевезення, доступні на
        Сайті під свою відповідальність. Busfor не несе відповідальність за дії,
        недбалість, помилки представників і гарантії будь-якого Постачальника, та/або
        будь-які травми, смерть, шкоду майну або інший збиток або витрати, отримані в
        результаті використання або доступу до послуг та/або товарів Постачальника. Busfor
        не несе відповідальності за незручності і втрати, отримані користувачем в
        результаті ненадання достовірної інформації при використанні Сайту, якщо така
        інформація надана Постачальником. Busfor не несе відповідальності за збитки та/або
        втрату квитка на той чи інший вид транспорту, за збитки отримані Користувачем в
        результаті запізнення автобусу до пункту де Користувач мав здійснити пересадку, у
        тому числі придбаним одним замовленням через Сайт. ПРЕТЕНЗІЇ І ПІДСУДНІСТЬ.
        Претензійний порядок розгляду звернень не є обов’язковим. При порушення умов
        Договору однією із Сторін протилежна Сторона має право звернутись до суду. Місце
        знаходження суду обирається у відповідності до чинного законодавства України.
        Спори з приводу Договору, Правил і Умов що є його частиною повинні вирішуватися в
        індивідуальному порядку. Якщо відповідний спір неможливо вирішити шляхом
        переговорів, він вирішується в судовому порядку за встановленою підвідомчістю та
        підсудністю такого спору відповідно до чинного законодавства України. Усі питання
        щодо відносин між Сторонами, які не врегульовані цим Договором, регулюються чинним
        законодавством України. ЗАУВАЖТЕ, що при порушення умов Договору перевезення,
        умови якого (дата, час відправлення/прибуття, місце посадки/висадки) наведені у
        Квитку несе Перевізник, що фактично виконував рейс. Позови до перевізника у
        відповідності до частини 4 статті 114. Цивільного Кодексу України підпадають під
        поняття «Виключна підсудність» і подаються до суду за місцем знаходження
        перевізника. ПРИКІНЦЕВІ ПОЛОЖЕННЯ. Номер Договору відповідає номеру придбаного
        Користувачем Квитка. Датою укладення Договору, є дата здійснення платежу, в
        рахунок обраного Квитка. У всьому іншому, що не передбачене Договором, Сторони
        керуються чинним законодавством України. Договір Правила та Умови є цілісним
        документом призначеним для користувача і мають переважаючу юридичну силу, в
        порівнянні з раніше укладеними письмовими або усними угодами між сторонами.
        Роздрукована версія даних Правил і Умов або будь-якого іншого повідомлення,
        створеного спочатку в електронній формі, може розглядатися в судових процесах,
        пов'язаних з даним Договором. Правилами і Умовами, з тієї ж вагомістю і на тих же
        умовах, як інші бізнес-документи, спочатку створені не в електронній, а у фізичній
        формі. ЛЕГІТИМНІСТЬ ЕЛЕКТРОННИХ ПОВІДОМЛЕНЬ Основний канал комунікації між Busfor
        і Користувачем - повідомлення електронними листами або публікації на сайті.
        Користувач погоджуєтеся з тим, що всі повідомлення, новини та інші комунікації в
        електронній формі Відповідають тим же юридичним вимогам, що і у паперовому
        вигляді. ПРАВИЛА ВИКОРИСТАННЯ САЙТУ busfor.ua Дані правила є невід’ємною частиною
        Договору публічної оферти і поширюються на всіх відвідувачів і користувачів Сайту
        busfor.ua (далі Сайт), по відношенню, як справжніх, так і майбутніх.
        Використовуючи Сайт або матеріали Сайту, Користувач висловлює свою безумовну згоду
        з даними Правилами. Примітка, щодо користування цим сайтом дітьми. Даний сайт не
        призначений для дітей, тож просимо, щоб діти не надавали та/або залишали особисту
        інформацію на цьому сайті. Мета правил Правила створені з метою визначення межі,
        дотримання якої є необхідним для використання Сайту. Правила сформульовані з
        урахуванням чинного законодавства України. Загальні положення Busfor визначає
        правила поведінки на Сайті і залишає за собою право вимагати їх виконання від
        Користувачів. Незнання правил не звільняє від необхідності їх виконання. ЗАХИСТ
        АВТОРСЬКИХ ПРАВ. Всі права на інформацію, розміщену на даному сайті, належать
        Busfor. Зміна матеріалів або використання їх за іншим призначенням є порушенням
        авторських прав. У разі порушення правил користування цим сайтом Busfor залишає за
        собою право застосувати до порушників всі допустимі законом запобіжні заходи, щодо
        захисту та відновленню своїх прав. На інших сторінках цього сайту можуть міститися
        інші зауваження про права власності та інформація про авторські права; положення,
        що містяться в таких зауваженнях, також повинні бути враховані і дотримані при
        користуванні. Користувач обізнаний і підтверджує, що Сайт і його зміст
        використовується для особистої і не комерційної вигоди. Користувач підтверджує, що
        не будете: втручатися або намагатися втручатися в штатну роботу Сайту, у тому
        числі, але не обмежуючись, із застосуванням вірусних атак, зміни пакетів TCP/IP
        або надсилання великої інформації, або діями, які можуть спричинити надмірне або
        непропорційно велике навантаження на інфраструктуру, яка підтримує Сайт;
        намагатися розшифрувати, декомпілювати, розібрати, і змінювати будь-яким іншим
        способом, будь-яку частину програмного забезпечення, яке становить і підтримує
        сайт і його зміст; видаляти або змінювати будь-які повідомлення про право
        власності, торгові знаки, будь-які рекламні матеріали зі змісту; включати рекламні
        та промо матеріали Свої або третіх осіб в зміст сайту, у тому числі але не
        обмежуючись, додаткові матеріали або функції Сайту; видавати себе за іншу фізичну
        або юридичну особу; вводити в оману з приводу приналежності до тої чи іншої
        фізичної чи юридичної особи; використовувати, вставляти та/або давати посилання на
        будь-які матеріали та інформацію з Сайту; використовувати Сайт не так, як
        дозволено в цих Правила та Умовах; та/або використовувати Сайт або будь-який його
        зміст, порушуючи відповідні закони. Busfor залишає за собою право забезпечувати
        дотримання цих Правил та Умов без повідомлень, а також на власний розсуд,
        припинити дію цих Правил і Умов, та/або припинити або призупинити доступ
        Користувача до використання Сайту в будь-який час без попереднього повідомлення у
        разі, якщо Користувач не дотримується (або є підстави підозрювати, що Користувач
        порушив) будь-який пункт даних Правил і умов. У разі, якщо Busfor в межах цих
        Правил і умов, обмежує та/або припиняє доступ Користувача до сайту, то Busfor не
        несе відповідальності і не покриває збитки Користувача, що виникли під час
        використання Сайту. ЗВІЛЬНЕННЯ ВІД ВІДПОВІДАЛЬНОСТІ. У тій мірі, в якій це
        дозволено законодавством, Busfor і пов'язані з ними компанії, директори,
        відповідальні керівники, співробітники, агенти, підрядники, наступники або
        довірені особи не несуть відповідальність за будь-які збитки, що випливають прямо
        або побічно з використання даного Сайту або будь якого іншого сайту, пов'язаного з
        даним Сайтом. За жодних обставин, відповідальність за наслідки, які прямо або
        побічно призвело використання інформації, розміщеної на цьому Сайті, не може
        покладатися на Busfor і бути підставою для їх судового переслідування. Busfor не
        заявляє і не гарантує, що який-небудь файл або програма, які можна завантажити з
        даного сайту та/або використовувати за його допомогою, не містить помилок,
        вірусів, дефектів та інших факторів, які можуть завдати шкоди даними, а також
        апаратному або програмному забезпеченню Користувача. Послуги Сайту надаються за
        принципом «як є» без гарантій будь-якого роду, як прямих, так і непрямих.
        Користувач в добровільному порядку відмовляється від судового переслідування
        Busfor і відшкодування можливої або заподіяної шкоди Користувачеві. Ні
        адміністрація Сайту, ні її партнери або співробітники не гарантують безперебійної
        та безпомилкової роботи Сайту; також вони не гарантують, що такими будуть як
        результати, отримані в ході використання Сайту, так і точність і застосовність
        його матеріалів. Busfor не несе ніякої відповідальності перед Користувачем або
        третіми особами за можливий збиток, пов'язаний з використанням інформації або
        матеріалів, розміщених на даному сайті. ТОЧНІСТЬ ІНФОРМАЦІЇ. Busfor докладатиме
        всіх зусиль, щоб забезпечити точність і актуальність даних, отриманих від
        відповідного Постачальника, що містяться на цьому сайті. У представленій
        інформації на цьому Сайті, можуть зустрітися технічні неточності або друкарські
        помилки. Busfor не бере на себе ніякої відповідальності за точність інформації,
        наданої на сайті, і весь ризик використання такої інформації покладається на
        Користувача. ПОСИЛАННЯ НА САЙТИ ТРЕТІХ ОСІБ. Даний сайт може містити інформацію
        про сайти третіх осіб. Перехід на будь-який інший Інтернет-ресурс, пов'язаний з
        даним сайтом, здійснюється на страх і ризик Користувача. Busfor не несе
        відповідальності за точність інформації, даних, поглядів, порад або заяв,
        зроблених на сторінках Сайту. Посилання на продукцію та послуги третіх осіб
        робиться в інформаційних цілях і не має на увазі, що Busfor їх підтримує або
        рекомендує або несе за це відповідальність. ЗМІНА УМОВ. Busfor час від часу може
        вносити зміни до Правил користування Сайтом. Проглядаючи даний сайт, Користувач
        зобов’язаний дотримуватися цих Правил, тому користувач зобов’язаний перевіряти їх
        зміст при кожному новому відвідуванні Сайту. Busfor залишає за собою право
        змінювати дані про послуги та продукцію в будь-який час без попереднього
        повідомлення Користувача. ПРИЙОМ І РОЗГЛЯД ЗВЕРНЕНЬ. Прийом звернень здійснюється
        ТОВ «І-Тревелс». Адреса для надсилання звернень: 03056, Київ, вулиця Польова 21,
        Діловий центр «Лагода» (для електронних звернень). Розгляд звернень. Розгляд
        звернень за послуги надані в межах договору публічної оферти здійснюється
        безпосередньо ТОВ «І-Тревелс». Розгляд звернень стосовно договору перевезення,
        обслуговування пасажира(ів), здійснюється відповідним перевізником, що надає такі
        послуги. У такому випадку ТОВ «І-Тревелс» надсилає отримане від пасажира звернення
        на адресу відповідного перевізника. Відповідь на звернення. Відповідь, за
        результатами розгляду звернень, надається користувачу шляхом аналогічним до їх
        надходження.
      </p>
    </div>
  );
};

export default PublickOffer;
